krayon/pinball-OPP/Stm32Workbench/OppGen3/Src/Common/digital.c
               if (solState_p->solState == SOL_INITIAL_KICK)
               {
                  /* Check if elapsed time is over initial kick time */
                  elapsedTimeMs = timer_get_ms_count() - solState_p->startMs;
                  if (elapsedTimeMs >= solCfg_p->initKick)
                  {
                     /* If this is a normal solenoid */
                     if ((solCfg_p->cfg & (ON_OFF_SOL | DLY_KICK_SOL | USE_MATRIX_INP)) == 0)
                     {
                        /* See if this has a sustaining PWM */
                        if (solCfg_p->minOffDuty & DUTY_CYCLE_MASK)
                        {
                           /* Make sure the input continues to be set */
                           if (solState_p->clearRcvd)
                           {
                              solState_p->solState = SOL_MIN_TIME_OFF;
                              solState_p->offCnt = 0;
                           }
                           else
                           {
                              /* Grab pwmIntenDur */
                              solState_p->solState = SOL_SUSTAIN_PWM;
                              solState_p->pwmIntenDur =
                                 FADE_USEC_DUR[(solCfg_p->minOffDuty & DUTY_CYCLE_MASK) << 1];
                              if (currUsTime <= solState_p->pwmIntenDur)
                              {
                                 dig_info.outputUpd |= solState_p->bit;
                              }
                           }
                        }
                        else
                        {
                           solState_p->solState = SOL_MIN_TIME_OFF;
                           solState_p->offCnt = 0;
                        }
                     }
                     else if ((solCfg_p->cfg & (DLY_KICK_SOL | USE_MATRIX_INP)) != 0)
                     {
                        solState_p->solState = SOL_MIN_TIME_OFF;
                        solState_p->offCnt = 0;
                     }
                     solState_p->startMs = timer_get_ms_count();
                  }
                  else if (currUsTime <= solState_p->intenDur)
                  {
                     dig_info.outputUpd |= solState_p->bit;
                  }
               }
            }
            else if (solState_p->solState == SOL_SUSTAIN_PWM)
            {
               if (((gen2g_info.solDrvProcCtl & currBit) == 0) &&
			     ((solState_p->inpBits == 0) ||
                 ((solState_p->inpBits & inputs) == solState_p->inpBits)))
               {
                  solState_p->clearRcvd = TRUE;
               }
               if (!solState_p->clearRcvd)
               {
                  /* Do faster PWM function by testing us timer */
                  if (currUsTime <= solState_p->pwmIntenDur)
                  {
                     dig_info.outputUpd |= solState_p->bit;
                  }
               }
               else
               {
                  /* Switch is inactive, move to idle */
                  solState_p->solState = SOL_STATE_IDLE;
               }
            }
            else if (solState_p->solState == SOL_MIN_TIME_OFF)
            {
               /* Check if an off time increment has happened */
               elapsedTimeMs = timer_get_ms_count() - solState_p->startMs;
               if (elapsedTimeMs >= solCfg_p->initKick)
               {
                  solState_p->offCnt += MIN_OFF_INC;
                  if (solState_p->offCnt >= (solCfg_p->minOffDuty & MIN_OFF_MASK))
                  {
                     solState_p->solState = SOL_STATE_IDLE;
                  }
                  else
                  {
                     solState_p->startMs = timer_get_ms_count();
                  }
               }
            }
            else if (solState_p->solState == SOL_WAIT_BEFORE_KICK)
            {
               /* Check if elapsed time is over the wait time
                * (stored in duty cycle nibble * 2)
                */
               elapsedTimeMs = timer_get_ms_count() - solState_p->startMs;
               if (elapsedTimeMs >= ((solCfg_p->minOffDuty & DUTY_CYCLE_MASK) << 1))
               {
                  /* Start the solenoid kick */
                  solState_p->solState = SOL_INITIAL_KICK;
                  solState_p->startMs = timer_get_ms_count();
                  dig_info.outputUpd |= solState_p->bit;
               }
            }
            else if (solState_p->solState == SOL_FULL_ON_SOLENOID)
            {
               if (((gen2g_info.solDrvProcCtl & currBit) == 0) &&
			     ((solState_p->inpBits == 0) ||
                 ((solState_p->inpBits & inputs) == solState_p->inpBits)))
               {
                  /* Switch is inactive, move to idle */
                  solState_p->solState = SOL_STATE_IDLE;
               }
               else if (currUsTime <= solState_p->intenDur)
               {
                  dig_info.outputUpd |= solState_p->bit;
               }
            }
         }
      }

      if ((gen2g_info.typeWingBrds & ((1 << WING_INP) | (1 << WING_SOL))) != 0)
      {
         DisableInterrupts;
         gen2g_info.validSwitch = (gen2g_info.validSwitch & ~dig_info.stateMask) |
            (dig_info.filtInputs & dig_info.stateMask);
         EnableInterrupts;
         dig_info.prevInputs = inputs;
      }
   }
} /* End digital_task */

/*
 * ===============================================================================
 * 
 * Name: digital_set_solenoid_input
 * 
 * ===============================================================================
 */
/**
 * Set a solenoid input
 *
 * Set a solenoid input.  To disable a solenoid, the input solenoid number can be
 * set to SOL_INP_CLEAR_SOL.
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    If multiple inputs are used to fire a solenoid, the inputs are
 *    logically OR'd together.
 * 
 * ===============================================================================
 */
void digital_set_solenoid_input(
   U8                         inpIndex,
   RS232I_SET_SOL_INP_E       solIndex)
{
   DIG_SOL_STATE_T            *solState_p;
   
   if (inpIndex < RS232I_NUM_GEN2_INP)
   {
      solState_p = &dig_info.solState[solIndex & SOL_INP_SOL_MASK];
      if ((solIndex & SOL_INP_CLEAR_SOL) == 0)
      {
         solState_p->inpBits |= (1 << inpIndex);
      }
      else
      {
         solState_p->inpBits &= ~(1 << inpIndex);
      }
   }
   else if ((inpIndex - RS232I_NUM_GEN2_INP) < RS232I_SW_MATRX_INP)
   {
      /* Inputs 32 to 96 are from the switch matrix, first verify
       * there is a switch matrix.
       */
      if ((gen2g_info.typeWingBrds & (1 << WING_SW_MATRIX_IN)) != 0)
      {
         if (solIndex & SOL_INP_CLEAR_SOL)
         {
            dig_info.mtrxData.info[inpIndex - RS232I_NUM_GEN2_INP].sol = 0;
         }
         else
         {
            dig_info.mtrxData.info[inpIndex - RS232I_NUM_GEN2_INP].sol =
               MATRIX_FIRE_SOL | (solIndex & SOL_INP_SOL_MASK);
         }
      }
   }
} /* End digital_set_solenoid_input */

